# Customer Segmentation System :- Data Cleaning

In [2]:
import numpy as np
import pandas as pd

df = pd.read_csv(r"C:\Users\giris\Downloads\customer_personality_20k.csv")

In [3]:
df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,4297,1969,Graduation,Together,23228.0,1,0,26-01-2014,71,13,...,8,0,0,0,0,0,0,3,11,0
1,2811,1963,PhD,Single,48918.0,1,1,12-04-2014,21,52,...,4,0,0,0,0,0,0,3,11,0
2,3412,1951,Master,Married,67381.0,0,1,15-01-2013,67,815,...,7,0,1,0,0,0,0,3,11,0
3,9964,1979,Graduation,Single,61825.0,0,1,07-08-2013,56,162,...,4,0,0,0,0,0,0,3,11,0
4,10785,1969,Graduation,Married,44078.0,1,1,19-06-2014,17,24,...,5,0,0,0,0,0,0,3,11,0

In [4]:
# shape of the data
df.shape

(20000, 29)

In [5]:
# info about the data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   20000 non-null  int64
 1   Year_Birth           20000 non-null  int64
 2   Education            20000 non-null  object
 3   Marital_Status       20000 non-null  object
 4   Income               19768 non-null  float64
 5   Kidhome              20000 non-null  int64
 6   Teenhome             20000 non-null  int64
 7   Dt_Customer          20000 non-null  object
 8   Recency              20000 non-null  int64
 9   MntWines             20000 non-null  int64
 10  MntFruits            20000 non-null  int64
 11  MntMeatProducts      20000 non-null  int64
 12  MntFishProducts      20000 non-null  int64
 13  MntSweetProducts     20000 non-null  int64
 14  MntGoldProds         20000 non-null  int64
 15  NumDealsPurchases    20000 non-null  int64
 16  NumWebPurchases      20000 non-null  int64
 17  NumCatalogPurchases  20000 non-null  int64
 18  NumStorePurchases    20000 non-null  int64
 19  NumWebVisitsMonth    20000 non-null  int64
 20  AcceptedCmp3         20000 non-null  int64
 21  AcceptedCmp4         20000 non-null  int64
 22  AcceptedCmp5         20000 non-null  int64
 23  AcceptedCmp1         20000 non-null  int64
 24  AcceptedCmp2         20000 non-null  int64
 25  Complain             20000 non-null  int64
 26  Z_CostContact        20000 non-null  int64
 27  Z_Revenue            20000 non-null  int64
 28  Response             20000 non-null  int64
dtypes: float64(1), int64(25), object(3)
memory usage: 4.4+ MB

In [ ]:
# statistical summary
df.describe()

,ID,Year_Birth,Income,Kidhome,Teenhome,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
count,20000.000000,20000.000000,19768.000000,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000,...,20000.000000,20000.000000,20000.000000,20000.000000,20000.00000,20000.000000,20000.000000,20000.0,20000.0,20000.000000
mean,5601.261150,1968.879400,52474.706293,0.446800,0.499250,48.914400,305.758550,26.925700,169.744250,37.801500,...,5.305350,0.075600,0.071850,0.073350,0.06910,0.013800,0.009550,3.0,11.0,0.152450
std,3238.034074,11.998881,26324.019960,0.536455,0.541862,28.757763,338.956549,40.731445,227.900295,54.869259,...,2.418016,0.264364,0.258246,0.260717,0.25363,0.116663,0.097259,0.0,0.0,0.359466
min,0.000000,1893.000000,1730.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000,3.0,11.0,0.000000
25%,2868.000000,1959.000000,35441.000000,0.000000,0.000000,24.000000,24.000000,2.000000,16.000000,3.000000,...,3.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000,3.0,11.0,0.000000
50%,5510.000000,1970.000000,51518.000000,0.000000,0.000000,49.000000,174.000000,8.000000,68.000000,12.000000,...,6.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000,3.0,11.0,0.000000
75%,8427.000000,1978.000000,68758.500000,1.000000,1.000000,74.000000,505.000000,33.000000,239.000000,50.000000,...,7.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000,3.0,11.0,0.000000
max,11191.000000,1996.000000,666666.000000,2.000000,2.000000,99.000000,1493.000000,199.000000,1725.000000,259.000000,...,20.000000,1.000000,1.000000,1.000000,1.00000,1.000000,1.000000,3.0,11.0,1.000000

In [8]:
# null values in each column
df.isnull().sum()

ID                       0
Year_Birth               0
Education                0
Marital_Status           0
Income                 232
Kidhome                  0
Teenhome                 0
Dt_Customer              0
Recency                  0
MntWines                 0
MntFruits                0
MntMeatProducts          0
MntFishProducts          0
MntSweetProducts         0
MntGoldProds             0
NumDealsPurchases        0
NumWebPurchases          0
NumCatalogPurchases      0
NumStorePurchases        0
NumWebVisitsMonth        0
AcceptedCmp3             0
AcceptedCmp4             0
AcceptedCmp5             0
AcceptedCmp1             0
AcceptedCmp2             0
Complain                 0
Z_CostContact            0
Z_Revenue                0
Response                 0
dtype: int64

In [10]:
# we are filling median of income in null values
df['Income'].fillna(df['Income'].median(), inplace=True)

C:\Users\giris\AppData\Local\Temp\ipykernel_10280\4076196949.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Income'].fillna(df['Income'].median(), inplace=True)

In [11]:
df.isnull().sum()

ID                     0
Year_Birth             0
Education              0
Marital_Status         0
Income                 0
Kidhome                0
Teenhome               0
Dt_Customer            0
Recency                0
MntWines               0
MntFruits              0
MntMeatProducts        0
MntFishProducts        0
MntSweetProducts       0
MntGoldProds           0
NumDealsPurchases      0
NumWebPurchases        0
NumCatalogPurchases    0
NumStorePurchases      0
NumWebVisitsMonth      0
AcceptedCmp3           0
AcceptedCmp4           0
AcceptedCmp5           0
AcceptedCmp1           0
AcceptedCmp2           0
Complain               0
Z_CostContact          0
Z_Revenue              0
Response               0
dtype: int64

In [ ]:
# converting Dt_Customer to datetime format
df['Dt_Customer'] = pd.to_datetime(df['Dt_Customer'])

C:\Users\giris\AppData\Local\Temp\ipykernel_10280\177162232.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['Dt_Customer'] = pd.to_datetime(df['Dt_Customer'])

**Feature Engineering**

In [ ]:
# creating a new column 'Age' from 'Year_Birth'
df['Age'] = 2025 - df['Year_Birth']

In [ ]:
# creating a new column 'Family_Size'
df['Family_Size'] = 1 + df['Kidhome'] + df['Teenhome']

In [ ]:
# creating a new column 'Total_Spending'
spend_cols = ['MntWines','MntFruits','MntMeatProducts','MntFishProducts',
              'MntSweetProducts','MntGoldProds']
df['Total_Spending'] = df[spend_cols].sum(axis=1)

In [ ]:
# creating a new column 'Total_Purchases'
purchase_cols = ['NumWebPurchases','NumCatalogPurchases','NumStorePurchases']
df['Total_Purchases'] = df[purchase_cols].sum(axis=1)

In [ ]:
# creating a new column 'Customer_For_Days'
df['Customer_For_Days'] = (df['Dt_Customer'].max() - df['Dt_Customer']).dt.days

**Removing illagical data**

In [ ]:
# removing rows where Total_Spending is 0
df = df[df['Total_Spending'] > 0]

In [ ]:
# removing unrealistic ages
df = df[(df['Age'] >= 18) & (df['Age'] <= 90)]

In [ ]:
# removing income outliers (top 1%)
df = df[df['Income'] < df['Income'].quantile(0.99)]

In [ ]:
# standardizing Marital_Status values
df['Marital_Status'].replace({
    'YOLO': 'Single',
    'Absurd': 'Single',
    'Alone': 'Single',
}, inplace=True)

C:\Users\giris\AppData\Local\Temp\ipykernel_10280\3635842263.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Marital_Status'].replace({

In [22]:
df['Marital_Status'] = df['Marital_Status'].replace({
    'Together': 'Married'
})

In [ ]:
# standardizing Education values
df['Education'] = df['Education'].replace({
    '2n Cycle': 'Secondary'
})

In [24]:
# Columns to drop
drop_cols = [
    'Z_CostContact',
    'Z_Revenue',
    'Year_Birth',       
    'Dt_Customer'       
]

 
df = df.drop(columns=[col for col in drop_cols if col in df.columns])

df.head()

,ID,Education,Marital_Status,Income,Kidhome,Teenhome,Recency,MntWines,MntFruits,MntMeatProducts,...,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Response,Age,Family_Size,Total_Spending,Total_Purchases,Customer_For_Days
0,4297,Graduation,Married,23228.0,1,0,71,13,2,18,...,0,0,0,0,0,56,2,40,5,154
1,2811,PhD,Single,48918.0,1,1,21,52,0,9,...,0,0,0,0,0,62,3,62,5,78
2,3412,Master,Married,67381.0,0,1,67,815,8,53,...,0,0,0,0,0,74,2,957,13,530
3,9964,Graduation,Single,61825.0,0,1,56,162,50,100,...,0,0,0,0,0,46,2,424,14,326
4,10785,Graduation,Married,44078.0,1,1,17,24,1,10,...,0,0,0,0,0,56,3,41,5,10

**Saving the Dataset**

In [25]:
import os

save_path = "data/processed"
os.makedirs(save_path, exist_ok=True)

file_path = os.path.join(save_path, "customer_cleaned.csv")
df.to_csv(file_path, index=False)

print("File saved at:", file_path)

File saved at: data/processed\customer_cleaned.csv